Tekla Open API Reference for Tekla Structures 2025
Double Structure
 The Double datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
[TypeConverterAttribute(typeof(DoubleConverter))]
public struct Double : IXmlSerializable, IDoubleDataType,
	IDataType, IEquatable<Double>, IComparable<Double>
<SerializableAttribute>
<TypeConverterAttribute(GetType(DoubleConverter))>
Public Structure Double
	Implements IXmlSerializable, IDoubleDataType, IDataType, IEquatable(Of Double),
	IComparable(Of Double)
The Double type exposes the following members.
Constructors
Name | Description
Double
 Creates a new double datatype instance.
Top
Properties
Name | Description
Value
 The value of the double datatype.
Top
Methods
Name | Description
CompareTo
 Compares the current object with another object of the same type.
Equals(Object)
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
Equals(Double)
 Indicates whether the current object is equal to another object of the same type.
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
GetSchema
 Gets the XML Schema for the datatype.
ReadXml
 Parses a new value from the given reader.
ToString
 Returns the string representation of the object.
 (Overrides ValueType.ToString().)
WriteXml
 Writes the value as XML to the given writer.
Top
Operators
Name | Description
Equality
 Compares a double value with a Datatype.Double value.
Implicit(Double to Double)
 Converts from double to Datatype.Double.
Implicit(Double to Double)
 Converts from Datatype.Double to double.
Inequality
 Compares a double value with a Datatype.Double value.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace